[{"review": "A huge improvement from its predecessors in all aspects(combat, exploration, synthesis, visual, audio, etc.). If you're a fan of any Atelier series, you'll love it.\nAll I want to say is, this game's fun.", "positive": true}, {"review": "Pros\n+ Flat F♥♥♥ Friday starring Peevish Pettanko Plachta\n\nCons\n- Dungeon Weather Control", "positive": true}, {"review": "Wonderful return to form for the Atelier series. \n\nI enjoyed Ryza but I like the mysterious trilogy's gameplay and alchemy way better, and this is a great refinement of those systems. So far, I really like the characters, and the map/environmental design is still top notch. The music, as always, is an absolute treat. The addition of the weather system is also neat, as it kinda makes it a puzzle to travel through the new zones since some paths open and close depending on what the weather is. The actual combat is also improved, as the 'tap in' system helps you use every character in your party whether it be for attacking or swapping in for a guard.\n\nPerformance could be better, it's a definite downgrade from Blue Reflection Tie and the Ryza games since those ran relatively flawlessly on my system, but isn't terrible since they actually have decent graphics settings to tweak (though the aliasing is particularly bad in this, and nothing I've tweaked has been able to mitigate it).\n\nOverall, highly recommended!", "positive": true}, {"review": "Fun", "positive": true}, {"review": "was ready to refund when I couldn't interact with the first barrel I came across, but then I actually could interact with the barrel in the atelier so it's all good\n\nsolid 10/10", "positive": true}, {"review": "Good game.\nI like Weather and Alchemy system.", "positive": true}, {"review": "kamige", "positive": true}, {"review": "Feels a little slow in the first half. Don't expect a lot of character scenes at the start. Later half it opens up. Aura system with boss/big fights is interesting, I like it but could see how some players might find it annoying. Solid Atelier game.", "positive": true}, {"review": "Game is really fun, the turned based gameplay is back and it feels really fresh and different, I feel like it's a combination of Ryza but as turned based.", "positive": true}, {"review": "Buy it!", "positive": true}, {"review": "I've never refunded a game until now. I wanted to play with mouse and keyboard but for some reason the game has a constant stutter unless a controller is plugged in. There were no frame drops, just some weird stutter every two seconds or so.  Once I connected my controller it was fixed, but then I ran into another issue. I got to a point in the conversation which had 4 options for inputs and wouldn't you know it? the button choices were all mouse and keyboard options. So I was forced into plugging in a controller only to see mouse and keyboard button options once I did, what?!?!? I tried to go into settings to see if I had to select a controller specifically only to find there was no way to set one way or another, both command lists were apparently constantly active? Why it was choosing mouse and keyboard with the controller connected I have no idea.", "positive": false}, {"review": "21 hours later and only about halfway through the story, so take this review with a grain of salt\n\nAltier Sophie is a very enjoyable game set after the events of the first game (obviously). Sophie now finds herself in a dream world that allows her to meet new characters and even a few surprise characters from the original game. That's about all I'll say about the story as that's all I cared to follow on it. \n\nBeing perfectly honest here, I haven't been that impressed with the Altier games stories. I don't know if it's the dialogue or the heavily recycled/cheap animation shortcuts they take, but I just can't get too invested in these characters or the story they're involved in.\n\nThankfully where Altier Sophie lacks in story, it makes up for in it's game play loop. You are an alchemist (again obviously) so you wander the maps in this game gathering up various resources to meld them all to create you're latest mad experiment, be it weapons, armor, explosives, cra... I MEAN medicine. As a gamer who hasn't played many games with this style of game play, I find it to be enjoyable, rewarding, and relaxing. My one sole critique with this one part of the game is the board that is used to combine the ingredients is very one note. there's no variation in the board itself so your not presented with much challenge outside of how to arrange the actual ingredients.\n\nThe combat of this game is also enjoyable in it's own right (take it from the guy who usually doesn't enjoy turn based combat) neat party swaps, fun animations, plus the option to speed up the combat speed to make grinding feel a little less tedious (thanks to whoever pitched that idea) Honestly I preferred the seamless combat in Altier Ryza, but this one is still good. The only downside is the difficulty spikes you encounter with each boss battle, you'll be going through the dungeon area and not even realize you're about to come up on a boss battle.  The other annoyance is that you can't flee to grind levels or get better geared for it.\n\nNot a super technical gamer, but the only trouble I've run into is the occasional PERSISTENT frame drops, makes the game feel choppy, but tends to go away after loading a new area. Which reminds me... the load times in this game are actually VERY QUICK. I know people expect nonexistent load times, but with how fast you can go from your cozy home to the current dungeon is a great touch.\n\nall and all, I give this game an 8/10, worth your time if you enjoy just a fun slice of life adventure. No huge complex plot (by JRPG standards) lots of quirky characters, fun game play loop, and a decent combat system. Plus plenty of cute potential waifus (again.... obviously)", "positive": true}, {"review": "Like the first game, but expands on existing mechanics and makes a lot of things better.", "positive": true}, {"review": "The original Sophie was what got me into the series, very happy to see her return. Few things I’d like to mention. You no longer need to aimlessly search for a specific item; they did a great job with the world map which now displays all of the materials/monster that can be found corresponding to a single area. The combat returns to its classic turn-based system, it feels more comfortable and less hectic compared to Ryza. Your entire party can join in on the fight and there’s also a double speed option. Love the new group, esp Ramizel and as always big wholesome vibes all round.", "positive": true}, {"review": "Best Atelier game yet. Has the great duo of Sophie and Plachta with all of the quality of life improvements of the later \"Mysterious\" Games and the graphics of Ryza. Perfect for a comfy grindy rpg afternoon.\n\nThe main story, never really the strength of these games, is still somewhat lacking but is more interesting and gripping than any of the Atelier games I've played. \nWe still get the variety of characters and the mini interaction cutscenes with them as we get to know them more.\nCombat is a bit like Lydie and Suelle but more refined. 3 people in battle and 3 in support with skills allowing you to swap them more or less at will.\nCrafting is the Tetris style \"fit all your materials in the pot\" of past Mysterious games with \"Links\" being the mechanic to increase max effects. Can be very in depth if you want it to be. The trait transfer and combination system works just like the previous games.\n\nMy only real critique so far is the weather system. Although I like the idea of changing the areas to allow different places to be explored, the items to do it have to be recharged between uses. The items hold 20 charges each... but you end up changing the weather A LOT and it can be a hassle having to stop and go back to refill. That and weather can be changed in battle which feels a little shallow and more of a binary \"Either the enemy is buffed or debuffed\" system. I feel it could have been fleshed out more.", "positive": true}, {"review": "Yet another great entry in the Atelier series.", "positive": true}, {"review": "It's Sophie 2...", "positive": true}, {"review": "I missed this kind of gameplay, haven't finished the game yet but the story is intriguing and synthesis is fun. I prefer this to Ryza's synthesis.", "positive": true}, {"review": "I'm still very early into this Atelier, but first impressions are very positive. It basically meshes the better aspects of Atelier Sophie with some good aspects from Ryza and Ryza 2, and the end result is great.\n\nThe synthesis system is very similar to Atelier Sophie on the surface, but the few changes have a big impact. Sophie system was very good, this one also is. Might be my favorite crafting system yet.\n\nThe combat system feels like a good upgrade, especially with how it deals with stacking buffs and debuffs, and I think is my favorite turn-based combat in the series so far (I haven't played Lulua yet to compare it with that one, though). I particularly really like that it makes you use your \"reserve characters\" as well, I always appreciate combat systems that do that - makes you care and equip your whole party instead of picking just one single team.\n\nThe \"Very Hard\" difficulty is once again decent enough that it can be enjoyable, not being the snore-fest that it was on Ryza 2, though I still think they should just let us pick Charismatic right out of the start instead of locking it behind a game clear.\n\nThe only issues I have so far is with port quality; it carries the same issues that Ryza 2 has. Stuttering, frame drops, and restricted keybindings for keyboard to the point that I prefer playing with a controller.", "positive": true}, {"review": "Good Game with Good Pain.....", "positive": true}, {"review": "My initial expectation was something along the lines of A20/Lulua, where the effort, budget, and creative energy felt very scaled back from the more traditional mainline releases like the Mysterious trilogy games. I'm not very far in yet but I have done my research and been in this business for over a decade now. \n\nMusic is definitely scaled back, with a return to VSTs from the mostly live instruments of Ryza 2, and with the entire tracklist being loaded onto two familiar series regulars (except one track by the ACRYLICSTAB guy and the opening vocal song by our beloved Yano). However, it's perfectly fine as comfort food and Yanagawa is such a monster he still has lots of pleasant surprises spread throughout.\n\nBy virtue of being so much more recent than earlier games like the original Sophie, most of the graphics look super good. I can't get over how good Sophie looks now in 2022. However, I don't think I can get anti-aliasing to work with this game. The borders of character models look extremely rough except from a comfortable distance (then they get a warm glow and the issue vanishes). I'm extremely used to this after so many games, if anyone has a magic solution to it that'd be neat though. The movies drag REALLY hard for me, will check a few settings but for now I am just overlooking the issue since I can view them outside of the game anyway and they're mostly extraneous flavour. \n\nThe grid alchemy from the rest of the Mysterious trilogy makes a return. Personally, I'm a HUGE fan of it. Ryza's node system felt a little too straightforward particularly in the lategame while earlier series didn't have much room for \"active alchemy\", mostly relying on just tossing traits back and forth in long strings. The little grid puzzles are fun in seeing what you can squeeze out with some obscure materials. I liked the combat in A19 so much and I have yet to delve into it enough to make much judgment on how the lategame parties shape up, but I am optimistic. \n\nVery solid release so far, just recognize it's not the same scale of product as Ryza 2 or Lydie & Suelle. I'll take it over a Ryza 1 for sure...", "positive": true}, {"review": "\"Dude, I dunno if I can pound your grandma.\"", "positive": true}, {"review": "This game has crafting where you have to put in effort and think, unlike the last two", "positive": true}, {"review": "- Great improvement of the Atelier series without breaking the old goodies.\n- Tons of QoL improvements make you can more enjoy the alchemy system.\n- Combat system is using Sophie turn-base with touch of latest series innovation.\n- Totally recommend to start with hard difficulty to fully enjoy battle.\n- Map design is better than ryza 2 imo.\n- The fast-forward in scene (probably 1.5x) is savior which let you actually enjoy the story without spend lot of them to watch those animations move slowly.\n\nGust you are doing the great job for Atelier series 25th anniversary.", "positive": true}, {"review": "Atelier Sophie was what got me into the Atelier Series. Atelier Ryza was what made me fall in love.\nWhile Atelier Sophie's story, and many of the ideas, were great, the game itself was just sorta bad. \nRyza fixed this by improving on the gameplay and adding thicc thighs.\nAtelier Sophie 2 is the charming story that first got me hooked on the series, with the added benefits of the improvements to gameplay from Atelier Ryza 2.\nMinus the thicc thighs.\nThe alchemy is different though, so if you have experience w/ that, just know it's different. But I'm not sure which I prefer.", "positive": true}, {"review": "什么都好，就是检测手柄的卡顿能不能修一下，真的很僵。", "positive": true}, {"review": "Only a few hours into my first ever JRPG - it's so much fun!\nThere are many mechanics to juggle and lots to explore :)\n\nPhoto mode has so many options.. is that a JRPG thing?\n\nPossibly the best swimsuit simulation game I've seen. (5/7)", "positive": true}, {"review": "Barrel!!!", "positive": true}, {"review": "very good game so far", "positive": true}, {"review": "Smol Plachta & more Sophie", "positive": true}, {"review": "good game", "positive": true}, {"review": "If you liked Sophie and Ryza, you'll love this. Nothing radically new, just an improvement and refinement to the crafting-heavy rpg format. l The combat sees the biggest improvement, bringing back features from Dusk trilogy: you can now have allies block or assist with an attack, and basically choose who takes the blow. You can also see who a monster is targeting ahead of time, so you can plan strategically. \n\nAlso further visual improvements and minor QOL changes to crafting. \n\nAs someone who has played every Atelier game released - this is their best work and possibly the best place to start the series.", "positive": true}, {"review": "UUUUUUUUUUUOOOOOOOOOOOOOOOOOOOOOOOOOOOHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH MY GRANDMA CAN'T BE THIS HOT :sob:", "positive": true}, {"review": "Sophie > Ryza", "positive": true}, {"review": "Looking to be the best entry in the series so far, tons of QOL improvements and new mechanics to make the game feel fresh and dynamic. \nThe world and areas look great as well, although the performance could use some work.", "positive": true}, {"review": "BOOBA / 10", "positive": true}, {"review": "So if you're familiar with the atelier series you already know most of what to expect. Relevant points for people who play these games, there are significant quality improvements in this game in terms of graphics, the fast travel is unlocked early and is fairly designed, the port is great and runs well. \n\nIn terms of combat mechanics, its about as good as turn based gets with a mixture of mechanics from Firis and Sophie along with some of the things Ryza did well. One drawback is that you cannot do charged swings against trees like Ryza but otherwise the gathering is arguably easier and even comes with fun mini games.\n\nBesides this we get to beat up a cute butterfly goddess so thats a huge bonus point.", "positive": true}, {"review": "is to cute eqwlfdjnneasiljufbnijlszrfgnijldsfnvgljkozsnfkg nrsjkgnl;jae.......but does not support ultrawide monitor. somewhat stable frames with the highest settings. specs ryzen 9 5950x, rtx 3090, 32 gigs of ram. 1440p", "positive": true}, {"review": "I am just barely at 1 hour in and I can safely say that this is the best Atelier I have ever played. For one, Sophie! Shes my favorite alchemist and being able to see her story continue is amazing. Second, the story is extremely intriguing and is very unique. Third, the graphics are simply breathtaking!", "positive": true}, {"review": "story is interesting, ans the combat fixed with great ideas \nSophie's character is so charming and young plachta is so cute\nramizel is the best", "positive": true}, {"review": "I am writing this review as a first-time Atelier player. To be honest I didn't really know what to expect, but unfortunately the first half hour of the game was enough to tell me this just isn't for me. I just really dislike how slow-paced the game is. Firstly your character is as slow as molasses relative to how large the environments are. I suspected something was off when I saw they were actually selling running speed as DLC (no joke, look at the Digital Deluxe version features), and as it turns out your base speed being obscenely slow is simply due to malevolence rather than incompetence. But that's not all. Characters will talk endlessly and say so little--60% of every conversation can be safely ignored. I'm fine with slice of life but that should come with interesting characters with interesting things to say--this game rides so hard on its moe aesthetic that I guess it's just supposed to make up for the bland dialogue and characters. Yeah the girls are cute but how long can I be expected to endure their one-note innocent kawaii 10-year-old shtick and not get a little tired of it? And would it kill them to include honorifics in the translations? If you're not going to have an English dub, just go all the way and keep the translations literal. The more dissonance between what the characters say vs. what the translations say, the less immersed I am and the less I can transpose the character's Japanese voice to the English words on the screen in my head.\n\nOk now moving on to the graphics--they're not very good. The game looks like a PS3 game. I wasn't expecting a masterpiece but if you're selling the game for $60, it should look nice right? It's actually really jarring because, while the lighting system looks fairly modern, the geometry and textures are easily from 10 years ago if not more. Anyways I'm half an hour in and experienced no gameplay, and I figure I won't even really be in the gameplay loop until 5-6 hours into the game, at which point it's too late to refund. Sorry but I'm not taking that chance. This one is probably best left for the fans. Any newcomers who are interested in buying this game--even if the gameplay seems appealing, you will have to deal with an RPG that is slow in pacing and generally uninteresting. If you're ok trading substance for saccharine character interactions, i.e. you just want to turn your brain off, this might be worth checking out. \n\nSo what's the takeaway? Am I stamping my feet, demanding the next entry in this series to cater more to me? No. Who am I to come into a niche series with an existing fanbase and say it should change? It shouldn't. It's just not for me, and I'm happy for Atelier fans who get to celebrate another entry in their franchise. I just think it's good for prospective buyers to get an opinion from someone who was new to the series who did not like it. I think most should steer clear, maybe steer clear of Koei Tecmo as a whole as they seem more than content to fleece their customer base (seriously--there's the Atlus tax, then there's these guys).", "positive": false}, {"review": "Yes Iam buying this because SOPHIE ! ! !", "positive": true}, {"review": "Man, the new system makes me fall in love once more on Sophie series!", "positive": true}, {"review": "Great addition to the series, One of the synthisis I liked the most was Sophie one because it required some thinking about how and when to put certain items into the recipe in order to squeeze the best results out, but it also took a lot of time because of how important item order was to where you could spend a long time trying to figure out how to get two different things to the next threshold. This new synthesis (of what I have unlocked so far, none of the advanced stuff yet) keeps the puzzle aspect but does it in a way to respect the players time a bit more. The item refreshing took a middle ground between the more punishing when it is gone it is gone and the too easy of return home and it gets fully recovered and added a cost to recovering items charges, so somewhere right in the middle of the two extremes making gold actually useful something I never really used in other games since I always crafted my stuff. Now to the more unique part of this entree since Synthesis and item counts are basically tweaks half way between Sophie and newer games.The changing level mechanic, it is an interesting way to add a lot more maps without adding a lot more maps, I am not totally sold on it yet but it does add a level of puzzle design to the levels. All in all a great addition to the series.", "positive": true}, {"review": "For some reason my FPS problems all disappear when I plug in a controller.  So if you're having any frame drops.. Plug in a controller and watch the game play at 60 FPS!", "positive": true}, {"review": "if you love atelier series, it's worth buying.", "positive": true}, {"review": "[h1][url=https://www.nookgaming.com/atelier-sophie-2-the-alchemist-the-mysterious-dream-review/]Check Out the Full Review With Images Here[/url][/h1]\n\nAtelier Sophie 2: The Alchemist & The Mysterious Dream is both a love letter to the series’ past and a bold step towards its future. I was thoroughly impressed by the game’s ability to merge gameplay found in Ryza with the gameplay of the older titles without ever feeling as if it needed to compromise either. Nearly every new element it introduced felt like a logical evolution of past ideas, to a point where I’m surprised that some of them had only been introduced now. Although it has a small number of cracks holding it back slightly, Atelier Sophie 2 was an absolute delight of a game, and easily my new favorite in the series.\n", "positive": true}, {"review": "Best Atelier Series Ever Made. Oh, this even better than Atelier Ryza 2 in my opinion.\nVery fun and happy atmosphere. Many beautiful girls. \nVery good and very stable PC Port, not like the neighbor game on the same release date.. :)", "positive": true}, {"review": "The performance is bad, a lot worse than Ryza 2. Getting framerate drops all the way down to 40's while in town, turning down the settings doesn't seem to help much, if at all. Ryza 2 had high requirements for a budget anime game, but I could at least get a stable 1080p@60fps.\n\nMy system is i5-8400 / 1070 Ti / 16GB DDR4, better than the listed recommended requirements. If you're allergic to unstable framerates and don't have a high end GPU (2080 or better), then don't bother until they improve the performance in patches.", "positive": false}, {"review": "The gameplay of alchemy  is really fun but it is too expensive.", "positive": true}, {"review": "The best Atelier game so far in my opinion.\nCombat is much better, more dynamic and fun.\nAlchemy system is a lot more fun than Ryza.\nCharacters are super adorable.\nMaps are gorgeous.\nOptimization (performance/fps) is better than Blue Reflection Second Light, but worse than Ryza2. With a 2080Ti, my average fps is 40 (4K) or 60 (1440p).\n\nUpdate: Maps are enormous, exploration is so fun it reminds me of Atelier Firis! Characters are very funny and awesome! I'm having a blast!\n\nI will keep writing the review as I play!", "positive": true}, {"review": "full review\" https://www.sportskeeda.com/esports/atelier-sophie-2-the-alchemist-mysterious-dream-review-synthesize-perfect-dream-world\n.\n.\ndo you need to play sophie 1?: NO \n.\nAtelier Sophie 2 is a fresh take on Sophie's adventure, where she ventures into a new world of dreams, If Ryza took you by your feet for her thighs, sophie's cuteness has been doubled where each time she's not smiling, you will wanna hug her\n.\nnot a fan of turn-based?..dw, the battle system moves fast, like REALLY fast...there isn't a single dull moment even though the core mechanics is turn based itself, it's a huge leap towards something new in the series, where I feel like Koei will slowly bring in action combat to the mix as well", "positive": true}, {"review": "As always an amazingly fun Atelier. Graphically it's very cute and prettym the gameplay itself is very oriented at Sophie regarding Synthesis and gathering new ideas for recipes. The seamless battle system just makes the world even more enjoyable, and it also took a lot of QoL things from Ryza 2.\n\nA clear recommendation for any Atelier lover!", "positive": true}, {"review": "It seems that they have finally learnt how to proper port games to pc. I think this is the only atelier game that has some many graphic options to tune! The graphics and animations are really well done this time. But, they still need to polish the game a bit. My frames drop to 40 or 50 in some areas or while doing certain activities (like gathering or sometimes while using the cauldron and I have a 1080Ti, I know it's not the best gpu anymore but still.", "positive": true}, {"review": "Unironically the better Feb. 25th release compared to Elden Ring.\nIf Koei Tecmo manages to make a more stable PC port than you and added quite a decent number of graphical options to modify, you know you absolutely fucked up.", "positive": true}, {"review": "Bagi yang ga tahu siapa suami Ramizel Erlenmeyer itu adalah saya sendiri sekian.", "positive": true}, {"review": "Solphie is back!!! \n\n+ PC Graphic setting is back.\n+ Classic turn based system with modern system is back.\n+ Next level cutscene detail compare to past atelier games.\n+ Top notch music as expected from atelier game on par with persona music.\n+ Easy to fast travel and navigate the map.\n+ Auto-add materials for \"lazy people\" to perform alchemy.\n+ Map is very big with introduction of weather system.\n+ No need to play first game (Have flashback story for atelier sophie 1)\n+ Performance is ok with RTX3080 with avg 70fps with DOF and Motion Blur turning off on 4K.\n+ Guess have to play this first until elden ring got patch.", "positive": true}, {"review": "This is a nice continuation to Sophie's story with better graphics and imo better characters. This is so far, the best Atelier I've ever played.", "positive": true}, {"review": "very nice", "positive": true}, {"review": "Great so far. Visual are vibrant, new characters are charming, and all the gameplay features had been vastly improved from previous (mystery) games. Also, finally, no need for a launcher.", "positive": true}, {"review": "First time comment\nJust finished 1 again and come here for 2.\nNot disappointed at all.\nJust a little bit laggy, even with controller.\nStory improved, with an enhanced but similar to Lulua (I think) type of system\nSophie cute as always, along with loli plachta\nDefinitely recommended, even if you haven't played 1 yet, you can still watch the recap video to understand most, if not all of the main story in 1.\n(Love how they acknowledge the previous game and start Sophie from Lv. 20 and Alchemist Lv. 50)", "positive": true}, {"review": "Our \"mysterious\" waifu is back!!\n\nThis is my 10th Atelier game I play. \n\nSophie is super cute, beautiful!! I ran out of adjectives to describe how cute she is LoL xD, a gorgeous and colorful world!! even the NPCs are cute, the central town and indoors are exquisite detailed!! And even the Sophie clothes are very detailed too, and moreover, her skin is a different model than her coat, for example look at her arms and you will notice, even the fabric seams project shadows over her!!! Check in her back, the seam in her coat, its shadow changes if you move around... I really like how much love they put into even those details!\n\nGust already offered a high quality technical level on their games with Blue Reflection Second Light in past November 2021, and now they improved even more!! I'm happy for them.\n\nAs always, a cast of female characters charismatic and cute, and also interesting male characters, you know, the \"bishounen\" type.\n\nThe combat system was improved. We have back the turn-based system and I think is totally right because the Mysterious series always had it. I can't imagine a Mysterious game with the real-time combat system of Ryza series, for example. So a good decision of Gust, fortunately. +1 for them.\n\nMelodies: beautiful, orchestrated, totally connected with an Atelier game as always, so much that I could hear the soundtrack in my free time or even at office. I like it.\n\nBut, by FAR, the BEST aspect of this game is the story, or at least its foundations: Even though we already know about how the Mysterious series ends in Lydie & Suelle, and specially what happens with Plachta in the end, Gust really managed to tell an original story about one of many adventures Sophie faces throughout her journey, so it feels refreshed. No previous knowledge of previous Mysterious games is required and it offers a decent summary of how Sophie decides to embark herself in that journey with two objectives. A simple but effective way to get into the plot. Of course, I would recommend to play the complete series to enjoy even more. So if you get interested, go ahead.\n\nI'm happy Gust brought this beautiful game to us, the fans.", "positive": true}, {"review": "Looks like story is made such that players who have not played the old Sophie can still play without any problem.\n", "positive": true}, {"review": "Playing Sophie  = 15 year depression gone.\nPlaying Atelier Sophie 2 is arguably better than nofap, noporn, eating healthy, meditation, reading affirmation books, cold showers 5am, working out, watching Jordan Petersons speeches, dating, getting married, having kids.\n\nRamizel is my cute gf.\n\nI'll comeback when i finish the game.", "positive": true}, {"review": "The pinnacle of Atelier. 30 hours later I stand by this.\n10/10, new characters are charming (Aoi Yuki voicing Alette). Same as above.\nAlso runs flawlessly, at least haven't encountered any issue so far. Looks like KT has learned and they made a pretty decent game this time around. And yet again, I stand by this. 30+ hours later, zero crashes and only minor stuttering when opening the cauldron, barely noticeable.\nOne of the most polished games by Gust/KT. KBM working wonderful.\n100% recommended.\nExpanding on the game.\nThe classic turn-based is back, combat is like that one from Lydie and Suelle.\nThe tetris-like alchemy is back as well, pretty fun to use.\nAll major events are voiced, which is pretty nice, though the subtitles won't show up in some of the cutscenes.\nThe only downside would be the pricing. Though I honestly doubt they'd increase the sales by a significant amount if they lowered the price, which would prove detrimental.\nIn conclusion, this a rather solid game and probably the best Atelier to date.", "positive": true}, {"review": "[quote][h1]Full review (including score): https://youtu.be/lQTfwfo_P_Q\nWritten review below![/h1][/quote]\n\nAnother year, another Atelier game. This is now the 23rd entry in the series and it might just be the best yet.\n\n[b]Note: Trimmed review to fit character limit, check video for full version![/b]\n\n[h2]Do I need to play the first game?[/h2]\nAs someone that literally finished the first a couple weeks ago and then played through this sequel - I wouldn’t say it’s really all that necessary. Not that the first game is bad, but just that its story is particularly weak for an Atelier game and the fact that the entire thing can be summed up in a roughly four minute recap video tells you all you need to know about how complex the story was there.\n\nSo if you do want to jump in right here, it’s completely fine and the recap video will serve you well enough.\n\n[h2]Crafting[/h2]\nThe Tetris system makes its return and is somehow even better than it already was. Now, instead of having to swap cauldrons around to do things like rotate ingredients, you’re able to do that right off the bat and in its place you get some other neat features like link pieces, super successes, catalysts, and even an outright second alchemist to use.\n\nIt’s somehow much easier to understand and pick up than in the first game, yet maintains that same level of complexity - if not more so. The bulk of this is likely due to the new UI, which makes it much easier to identify ingredients, elements, etc. Whatever the case, I found myself really getting into it, trying to get the perfect ingredient spread to fill up all the spaces without overlapping, rotating the pieces just right to get the maximum number of links, and really just trying to min-max my way to some stupidly powerful items.\n\nHonestly, it might be the best I’ve seen in the series yet and this is coming from someone that has played nine entries.\n\n[h2]Gathering & Game World[/h2]\nTaking cues from Ryza, the game world is now this big, inter-connected thing. It’s not necessarily open world, but each area is large enough on its own that it kinda gives that impression. It’s not one of those “empty” open worlds though. There’s hills, forests, caves, ruins, and these are all flooded with enemies, items, treasure, and other stuff to find.\n\nIngredients are actually visible on the map this time and the combat now takes place without any loading screens. The game may have dropped some of the additional exploration tools introduced in the last Ryza game, but in its place introduced a new weather system.\n\nThe weather system was pretty cool at first, but I can’t deny that I became a bit iffy on it as the game went on. Having to cycle around the different weather settings to get to where I needed to go can be a bit tedious and it doesn’t help that the weather items have a set number of uses before being depleted.\n\nThe game does provide waypoints on the map that can be traveled to once activated, so it is not as annoying once you’ve explored an area, but I would say this new addition is okay at best.\n\n[h2]Graphics[/h2]\nCompared to some other genres it might not be the best, but for an Atelier game the graphics are absolutely some good stuff and comparable to the quality we got in the past two Ryza games. Actual level geometry, buildings that aren’t just giant blocks, and the character models are noticeably more crisp. Great news, as Sophie might just be my favorite Atelier protagonist design-wise.\n\n[h2]Combat[/h2]\nCombat is yet again another area of improvement and it feels really nice to finally get back to the tried and true turn-based formula of past Atelier games. For one, it’s fast-paced. Because entering combat requires no loading screens, you’re thrown right into it and can immediately start duking it out. Animations can be sped up to 2x and that was pretty much the default for me. The animations are already fast enough, but keeping it at 2x makes battles go significantly faster and you can easily get the materials you need from certain monsters within a matter of seconds.\n\nAnd if you do want to take it slow, there is a good bit of depth here. Twin actions, type matchups, skills, abilities, changing the weather mid-battle, and of course, all of the different items that can be crafted and then used in battle. It doesn’t go too out there in terms of complexity, but it’s not this dead simple thing either.\n\n[h2]Game Loop[/h2]\nIn the first Sophie, it felt like I was constantly doing the same basic process over and over - unlocking a new recipe, crafting it, then having to hunt down the next recipe to craft and so on. There was little actual story content until the end and a lot of the time I was doing guesswork trying to figure out which NPC, item, area, or whatever triggered the next recipe idea to allow me to progress.\n\nSophie 2 pretty much does away with this system entirely. Recipe ideas are still there and get triggered as you do stuff, but I hardly ever found myself locked behind some mystery gate for hours trying to figure out what to do. Instructions are not as vague, relevant NPCs, items, and monsters are marked on the map, and the game in general doesn’t waste your time grinding out recipes.\n\n[h2]Story[/h2]\nThe story this time is actually NOT terrible. Not only is the writing better, but the plot is weaved in and out of the gameplay in a manner that doesn’t require it to all be dropped at the end to wrap up in the time remaining. From the start you are constantly getting new cutscenes, character backgrounds, story events - the entire slate. There is much more dialogue this time around, but I also found it to be more interesting.\n\nI won’t sit here and tell you that it’s the best around - I mean, Atelier games generally aren't known for their writing - but it was engaging enough that it didn’t feel like an interruption to the otherwise excellent gameplay.\n\n[h2]PC Port[/h2]\nRunning at max settings, 1440p and 144 fps on my 3080 Ti was fine and I didn’t have any stability issues there, but the UI has this weird bug (I assume it is a bug) where whenever certain menus open or close, the game dips to 30 fps for a split second, resulting in a visible slowdown.\n\nThis is best demonstrated when opening a recipe for crafting or opening your storage container to view ingredients. Doing so immediately dips the fps before climbing back up again once the menu is visible. However, I also noticed the issue when gathering items on the map. When doing so, items are listed on the left side of the screen for a few seconds before disappearing and, unfortunately, when they do vanish from the screen, the game microstutters.\n\nOtherwise, the PC port is fine. Runs well, no crashes, and even has a good amount of settings to change - at least for a Koei Tecmo port. Controls on a controller are flawless, but the keyboard and mouse controls were practically unplayable for me. There is no mouse cursor for menus, the mouse is not locked to the game window when controlling the camera, and it jitters constantly. This is definitely not a game I would recommend if you do not have a controller to play it with.\n\n[h2]Overall[/h2]\nAtelier Sophie 2 is the best in the series yet, combining the elements that made the first Sophie fun with the recent advancements in Ryza to deliver a familiar, yet modernized Atelier experience. In-depth crafting, fun turn-based combat, great graphics and music, a story that is actually not terrible - there’s a lot of good to say about this game even if it may have a few technical flaws and some iffy elements. For newcomers, it still might be best to start with Ryza, but Sophie 2 is an easy next best choice.\n\nFollow my [b][url=https://store.steampowered.com/curator/3215371]Steam Curator Page[/url][/b] for more reviews + videos!!", "positive": true}]